## 14. 통계(기초)


## 참고자료
* [Python 완전정복 시리즈] 2편 : Pandas DataFrame 완전정복 : https://wikidocs.net/book/7188

In [1]:
import pandas as pd
import numpy as np

## 최대/최소 (max/min)

In [2]:
[N,T,F]=[np.NaN,True,False]
idx = [['IDX1','IDX1','IDX2','IDX2'],['row1','row2','row3','row4']]
col = [['COL1','COL1','COL2','COL2'],['val1','val2','val3','val4']]
data = [[N,13,3,4],[5,7,10,8],[15,6,N,3],[2,14,9,1]]
df = pd.DataFrame(data,idx,col)
df

           COL1       COL2
           val1 val2  val3 val4
IDX1 row1   NaN   13   3.0    4
     row2   5.0    7  10.0    8
IDX2 row3  15.0    6   NaN    3
     row4   2.0   14   9.0    1

In [3]:
df.max()

COL1  val1    15.0
      val2    14.0
COL2  val3    10.0
      val4     8.0
dtype: float64

In [5]:
df.max(axis=1)

IDX1  row1    13.0
      row2    10.0
IDX2  row3    15.0
      row4    14.0
dtype: float64

In [6]:
df.max(skipna=True)

COL1  val1    15.0
      val2    14.0
COL2  val3    10.0
      val4     8.0
dtype: float64

In [7]:
df.max(skipna=False)

COL1  val1     NaN
      val2    14.0
COL2  val3     NaN
      val4     8.0
dtype: float64

In [8]:
df.max(level=0)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/640071888.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  df.max(level=0)

      COL1       COL2
      val1 val2  val3 val4
IDX1   5.0   13  10.0    8
IDX2  15.0   14   9.0    3

In [4]:
df.min()

COL1  val1    2.0
      val2    6.0
COL2  val3    3.0
      val4    1.0
dtype: float64

In [9]:
df.min(axis=1)

IDX1  row1    3.0
      row2    5.0
IDX2  row3    3.0
      row4    1.0
dtype: float64

In [10]:
df.min(skipna=True)

COL1  val1    2.0
      val2    6.0
COL2  val3    3.0
      val4    1.0
dtype: float64

In [11]:
df.min(skipna=False)

COL1  val1    NaN
      val2    6.0
COL2  val3    NaN
      val4    1.0
dtype: float64

In [12]:
df.min(level=0)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/1519527888.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  df.min(level=0)

     COL1      COL2
     val1 val2 val3 val4
IDX1  5.0    7  3.0    4
IDX2  2.0    6  9.0    1

## 평균 (mean)

In [13]:
idx = [['IDX1','IDX1','IDX2','IDX2'],['row1','row2','row3','row4']]
col = [['COL1','COL1','COL2','COL2'],['val1','val2','val3','val4']]
data = [[N,13,3,4],[5,7,10,8],[15,6,N,3],[2,14,9,1]]
df = pd.DataFrame(data,idx,col)
df

           COL1       COL2
           val1 val2  val3 val4
IDX1 row1   NaN   13   3.0    4
     row2   5.0    7  10.0    8
IDX2 row3  15.0    6   NaN    3
     row4   2.0   14   9.0    1

In [14]:
df.mean()

COL1  val1     7.333333
      val2    10.000000
COL2  val3     7.333333
      val4     4.000000
dtype: float64

In [15]:
df.mean(axis=1)

IDX1  row1    6.666667
      row2    7.500000
IDX2  row3    8.000000
      row4    6.500000
dtype: float64

In [16]:
df.mean(skipna=True)

COL1  val1     7.333333
      val2    10.000000
COL2  val3     7.333333
      val4     4.000000
dtype: float64

In [17]:
df.mean(skipna=False)

COL1  val1     NaN
      val2    10.0
COL2  val3     NaN
      val4     4.0
dtype: float64

In [18]:
df.mean(level=0)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/2700814203.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  df.mean(level=0)

     COL1       COL2
     val1  val2 val3 val4
IDX1  5.0  10.0  6.5  6.0
IDX2  8.5  10.0  9.0  2.0

##  중앙값 (median)

In [19]:
[N,T,F]=[np.NaN,True,False]
idx = [['IDX1','IDX1','IDX2','IDX2'],['row1','row2','row3','row4']]
col = [['COL1','COL1','COL2','COL2'],['val1','val2','val3','val4']]
data = [[N,13,3,4],[5,7,10,8],[15,6,N,3],[2,14,9,1]]
df = pd.DataFrame(data,idx,col)
df

           COL1       COL2
           val1 val2  val3 val4
IDX1 row1   NaN   13   3.0    4
     row2   5.0    7  10.0    8
IDX2 row3  15.0    6   NaN    3
     row4   2.0   14   9.0    1

In [20]:
df.median()

COL1  val1     5.0
      val2    10.0
COL2  val3     9.0
      val4     3.5
dtype: float64

In [21]:
df.median(axis=1)

IDX1  row1    4.0
      row2    7.5
IDX2  row3    6.0
      row4    5.5
dtype: float64

In [22]:
df.median(skipna=True)

COL1  val1     5.0
      val2    10.0
COL2  val3     9.0
      val4     3.5
dtype: float64

In [23]:
df.median(skipna=False)

COL1  val1     NaN
      val2    10.0
COL2  val3     NaN
      val4     3.5
dtype: float64

In [24]:
df.median(level=0)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/1759685191.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  df.median(level=0)

     COL1       COL2
     val1  val2 val3 val4
IDX1  5.0  10.0  6.5  6.0
IDX2  8.5  10.0  9.0  2.0

## 최빈값 (mode)

In [25]:
[N,T,F]=[np.NaN,True,False]
idx = ['row1','row2','row3','row4']
col = ['col1','col2','col3','col4']
data = [['A',2,'x',N],['B',2,'y',N],['C',1,'y',1],['A',N,'z',3]]
df = pd.DataFrame(data,idx,col)
df

     col1  col2 col3  col4
row1    A   2.0    x   NaN
row2    B   2.0    y   NaN
row3    C   1.0    y   1.0
row4    A   NaN    z   3.0

In [27]:
df.mode()

# col4의 최빈값이 1과 3으로 두개이기 때문에 두개 다 출력, 나머지는 최빈값이 
# 하나이므로 1행에는 NaN출력

  col1  col2 col3  col4
0    A   2.0    y   1.0
1  NaN   NaN  NaN   3.0

In [28]:
df.mode(dropna=False)

  col1  col2 col3  col4
0    A   2.0    y   NaN

In [29]:
df.mode(numeric_only=True)

   col2  col4
0   2.0   1.0
1   NaN   3.0

## 표준편차 (std)

In [30]:
# 표본표준편차

[N,T,F]=[np.NaN,True,False]
idx = [['IDX1','IDX1','IDX2','IDX2'],['row1','row2','row3','row4']]
col = ['col1','col2','col3','col4']
data = [[1,5,7,13],[5,2,19,1],[13,6,4,12],[8,N,0,8]]
df = pd.DataFrame(data,idx,col)
df

           col1  col2  col3  col4
IDX1 row1     1   5.0     7    13
     row2     5   2.0    19     1
IDX2 row3    13   6.0     4    12
     row4     8   NaN     0     8

In [32]:
df.std()

col1    5.057997
col2    2.081666
col3    8.185353
col4    5.446712
dtype: float64

In [33]:
df.std(skipna=False)

col1    5.057997
col2         NaN
col3    8.185353
col4    5.446712
dtype: float64

In [34]:
df.std(axis=1)

IDX1  row1    5.000000
      row2    8.341663
IDX2  row3    4.425306
      row4    4.618802
dtype: float64

In [35]:
df.std(level=0)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/1011795809.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.var(level=1) should use df.groupby(level=1).var().
  df.std(level=0)

          col1     col2      col3      col4
IDX1  2.828427  2.12132  8.485281  8.485281
IDX2  3.535534      NaN  2.828427  2.828427

In [37]:
## ddof : 자유도, 표본표준편차 계산에 사용된느 분모인 n-ddof 값

df.std()

col1    5.057997
col2    2.081666
col3    8.185353
col4    5.446712
dtype: float64

In [38]:
df.std(ddof=2)

col1     6.194756
col2     2.943920
col3    10.024969
col4     6.670832
dtype: float64

In [40]:
df.std(ddof=3)

col1     8.760708
col2          NaN
col3    14.177447
col4     9.433981
dtype: float64

In [42]:
df.std(ddof=4)

col1   NaN
col2   NaN
col3   NaN
col4   NaN
dtype: float64

##  분산 (var)

In [44]:
[N,T,F]=[np.NaN,True,False]
idx = [['IDX1','IDX1','IDX2','IDX2'],['row1','row2','row3','row4']]
col = ['col1','col2','col3','col4']
data = [[1,5,7,13],[5,2,19,1],[13,6,4,12],[8,N,0,8]]
df = pd.DataFrame(data,idx,col)
df

           col1  col2  col3  col4
IDX1 row1     1   5.0     7    13
     row2     5   2.0    19     1
IDX2 row3    13   6.0     4    12
     row4     8   NaN     0     8

In [46]:
df.var

<bound method NDFrame._add_numeric_operations.<locals>.var of            col1  col2  col3  col4
IDX1 row1     1   5.0     7    13
     row2     5   2.0    19     1
IDX2 row3    13   6.0     4    12
     row4     8   NaN     0     8>

In [47]:
df.var(skipna=False)

col1    25.583333
col2          NaN
col3    67.000000
col4    29.666667
dtype: float64

In [48]:
df.var(axis=1)

IDX1  row1    25.000000
      row2    69.583333
IDX2  row3    19.583333
      row4    21.333333
dtype: float64

In [50]:
df.var(level=0)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/3901714178.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.var(level=1) should use df.groupby(level=1).var().
  df.var(level=0)

      col1  col2  col3  col4
IDX1   8.0   4.5  72.0  72.0
IDX2  12.5   NaN   8.0   8.0

In [51]:
df.var(ddof=1)

col1    25.583333
col2     4.333333
col3    67.000000
col4    29.666667
dtype: float64

In [52]:
df.var(ddof=2)

col1     38.375000
col2      8.666667
col3    100.500000
col4     44.500000
dtype: float64

In [53]:
df.var(ddof=3)

col1     76.75
col2       NaN
col3    201.00
col4     89.00
dtype: float64

In [54]:
df.var(ddof=4)

col1   NaN
col2   NaN
col3   NaN
col4   NaN
dtype: float64

## 평균절대편차 (mad)

In [55]:
[N,T,F]=[np.NaN,True,False]
idx = [['idx1','idx1','idx2','idx2'],['row1','row2','row3','row4']]
col = ['col1','col2','col3','col4']
data = [[1,-7,13,2],[9,2,-3,8],[8,N,3,0],[-1,12,9,7]]
df = pd.DataFrame(data,idx,col)
df

           col1  col2  col3  col4
idx1 row1     1  -7.0    13     2
     row2     9   2.0    -3     8
idx2 row3     8   NaN     3     0
     row4    -1  12.0     9     7

In [56]:
df.mad()

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/3844944795.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  df.mad()

col1    4.250000
col2    6.444444
col3    5.500000
col4    3.250000
dtype: float64

In [57]:
df.mad(axis=1)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/815027160.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  df.mad(axis=1)

idx1  row1    5.375000
      row2    4.500000
idx2  row3    2.888889
      row4    3.875000
dtype: float64

In [58]:
df.mad(skipna=False)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/1099072877.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  df.mad(skipna=False)

col1    4.25
col2     NaN
col3    5.50
col4    3.25
dtype: float64

In [59]:
df.mad(level=0)

/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/4201514051.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  df.mad(level=0)
/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/4201514051.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.mad(level=1) should use df.groupby(level=1).mad()
  df.mad(level=0)
/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/4201514051.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  df.mad(level=0)
/var/folders/qb/9ghy845j1v999lxpxzlv__9r0000gn/T/ipykernel_3688/4201514051.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  df.mad(level=0)

      col1  col2  col3  col4
idx1   4.0   4.5   8.0   3.0
idx2   4.5   0.0   3.0   3.5

## 누적 최대/최소 (cummax / cummin)

In [60]:
[N,T,F]=[np.NaN,True,False]
df = pd.DataFrame({'col1':[1,-2,5,3,0,7],'col2':[3,4,N,9,2,5]})
df

   col1  col2
0     1   3.0
1    -2   4.0
2     5   NaN
3     3   9.0
4     0   2.0
5     7   5.0

In [61]:
df.cummax()

   col1  col2
0     1   3.0
1     1   4.0
2     5   NaN
3     5   9.0
4     5   9.0
5     7   9.0

In [62]:
df.cummin()

   col1  col2
0     1   3.0
1    -2   3.0
2    -2   NaN
3    -2   3.0
4    -2   2.0
5    -2   2.0

In [63]:
df.cummax(skipna=False)

   col1  col2
0     1   3.0
1     1   4.0
2     5   NaN
3     5   NaN
4     5   NaN
5     7   NaN

## 누적합/누적곱 (cumsum / cumprod)

In [65]:
[N,T,F]=[np.NaN,True,False]
df = pd.DataFrame({'col1':[1,-2,5,3,-1,7],'col2':[3,4,N,9,2,5]})
df

   col1  col2
0     1   3.0
1    -2   4.0
2     5   NaN
3     3   9.0
4    -1   2.0
5     7   5.0

In [66]:
df.cumsum()

   col1  col2
0     1   3.0
1    -1   7.0
2     4   NaN
3     7  16.0
4     6  18.0
5    13  23.0

In [68]:
df.cumprod()

   col1    col2
0     1     3.0
1    -2    12.0
2   -10     NaN
3   -30   108.0
4    30   216.0
5   210  1080.0

In [69]:
df.cumsum(skipna=False)

   col1  col2
0     1   3.0
1    -1   7.0
2     4   NaN
3     7   NaN
4     6   NaN
5    13   NaN

## 분위수 (quantitle)

In [70]:
idx = ['row1','row2','row3']
col = ['col1','col2','col3']
data= [[0,1,32],[50,10,-9],[100,100,18]]
df = pd.DataFrame(data,idx,col)
df

      col1  col2  col3
row1     0     1    32
row2    50    10    -9
row3   100   100    18

In [73]:
df.quantile(q=0)

col1    0.0
col2    1.0
col3   -9.0
Name: 0.0, dtype: float64

In [74]:
df.quantitle(q=0.5)

AttributeError: 'DataFrame' object has no attribute 'quantitle'

In [77]:
df.quantile(q=0.5)

col1    50.0
col2    10.0
col3    18.0
Name: 0.5, dtype: float64

In [79]:
# interpolation는 분위수의 해당하는 값이 없는 경우 어떤 수를 출력할지 정하는 보간법
df.quantile(q=0.75, interpolation='linear')

col1    75.0
col2    55.0
col3    25.0
Name: 0.75, dtype: float64

In [82]:
df.quantile(q=0.75, interpolation='lower')

col1    50
col2    10
col3    18
Name: 0.75, dtype: int64

In [ ]:
ㅇㄹ.